Tekla.Structures.Drawing.PickerInputTwoPoints
The PickerInputTwoPoints class represents a pick of two points in a view.
Used for values asked by UI.Picker.PickTwoPoints(string FirstPrompt, string SecondPrompt, out Point FirstPickedPoint, out Point SecondPickedPoint, out ViewBase PickedView).

Tekla.Structures.Drawing.PickerInputTwoPoints.FirstPickedPoint
The first picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputTwoPoints.SecondPickedPoint
The second picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputTwoPoints.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputTwoPoints.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new PickerInputTwoPoints instance with two points selected in a view.
pickedView: The view in which the pick occurred.
firstPickedPoint: The first picked point in the view coordinates.
secondPickedPoint: The second picked point in the view coordinates.